robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/utils/stm32ee.c
/*
 * Copyright (C) 2012 iCub Facility - Istituto Italiano di Tecnologia
 * Author:  Marco Accame
 * email:   marco.accame@iit.it
 * website: www.robotcub.org
 * Permission is granted to copy, distribute, and/or modify this program
 * under the terms of the GNU General Public License, version 2 or any
 * later version published by the Free Software Foundation.
 *
 * A copy of the license can be found at
 * http://www.robotcub.org/icub/license/gpl.txt
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General
 * Public License for more details
*/


/* @file       stm32ee.c
	@brief      This file implements management of some i2c EEPROMs using stm32 apis.
	@author     marco.accame@iit.it
    @date       09/14/2012
**/

// - modules to be built: contains the HAL_USE_* macros ---------------------------------------------------------------
//#include "hal_brdcfg_modules.h"

//#ifdef HAL_USE_EEPROM

// --------------------------------------------------------------------------------------------------------------------
// - external dependencies
// --------------------------------------------------------------------------------------------------------------------

#include "stdlib.h"
#include "string.h"
#include "hal_stm32xx_include.h"

//#include "hal_brdcfg.h"
 
// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern public interface
// --------------------------------------------------------------------------------------------------------------------

#include "stm32ee.h"


// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern hidden interface 

#include "stm32ee_hid.h"

// --------------------------------------------------------------------------------------------------------------------
// - #define with internal scope
// --------------------------------------------------------------------------------------------------------------------

#define         STM32EE_maxEEPROMsize                   (64*1024)

#if     defined(USE_STM32F1)
#define          STM32EE_dma_dir_MEMORY2PERIPHERAL      DMA_DIR_PeripheralDST
#define          STM32EE_dma_dir_PERIPHERAL2MEMORY      DMA_DIR_PeripheralSRC
#elif   defined(USE_STM32F4)
#define          STM32EE_dma_dir_MEMORY2PERIPHERAL      DMA_DIR_MemoryToPeripheral
#define          STM32EE_dma_dir_PERIPHERAL2MEMORY      DMA_DIR_PeripheralToMemory
#endif



// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of extern variables, but better using _get(), _set() 
// --------------------------------------------------------------------------------------------------------------------

extern const stm32ee_cfg_t stm32_cfg_default = 
{ 
    .devcfg                 =
    {
        .device                 = stm32ee_device_st_m24lr64, 
        .i2cport                = 1,  
        .hwaddra2a1a0           = (0 << 2) | (0 << 1) | (0 << 0),
        .wpval                  = 0,
        .wppin                  =
        {
            .port                   = stm32ee_gpio_portNONE,
            .pin                    = stm32ee_gpio_pinNONE        
        },
        .functionontimeout      = NULL            
    },

    .i2ccfg                 =
    {
        .dontinit               = 0,
        .i2cspeed               = 4
    },
    
    .dmacfg                 =
    {
        .dontuse                = 0
    }
//    .i2cspeed               = 400000,
//    .i2cextinit             = 0,
//    .usedmatransfer         = 1,
//    .functioni2cinit    = NULL, 
//    .parameteri2cinit   = NULL, 
//    .functioni2cdeinit  = NULL 
};



// --------------------------------------------------------------------------------------------------------------------
// - typedef with internal scope
// --------------------------------------------------------------------------------------------------------------------

typedef struct
{
    uint32_t* data;
    uint32_t* size;
    uint32_t* dir;
} stm32ee_dma_cfg_mirror_t;


typedef struct
{
    uint32_t    clock;
    uint32_t    gpio_remap;
    uint32_t    gpio_remap_clock;
} stm32ee_i2cx_cfg_t;

typedef struct
{
    uint32_t            clock;
    GPIO_TypeDef*       port;
    uint16_t            pinnum;
    GPIO_InitTypeDef    pin;
} stm32ee_i2c_gpio_cfg_t;

typedef struct
{
    uint8_t                     initted;
    uint8_t                     hwaddress;                 // EEPROM HW address (typically 0xA0 ... but some bits may change .....
    uint16_t                    pagesize;
    uint32_t                    totalsize;
    stm32ee_cfg_t               cfg;
    I2C_TypeDef*                i2cx;
    stm32ee_i2cx_cfg_t          i2cx_cfg;
    stm32ee_i2c_gpio_cfg_t      i2c_gpio_scl;
    stm32ee_i2c_gpio_cfg_t      i2c_gpio_sda;
    volatile uint16_t*          prt2bytes2read;
    volatile uint16_t*          prt2bytes2write;
    volatile uint16_t           numberofbyte2writeinpage;
    volatile uint32_t           timeout;
    DMA_InitTypeDef             dma_cfg;
    stm32ee_dma_cfg_mirror_t    dma_cfg_mirror;
} stm32ee_generic_container_t;



// --------------------------------------------------------------------------------------------------------------------
// - declaration of static functions
// --------------------------------------------------------------------------------------------------------------------

static stm32ee_result_t s_stm32ee_i2c_common_init(const stm32ee_i2c_cfg_t *i2ccfg);
static stm32ee_result_t s_stm32ee_i2c_common_deinit(const stm32ee_i2c_cfg_t *i2ccfg);


static stm32ee_result_t s_stm32ee_wp_init(void);
static stm32ee_result_t s_stm32ee_wp_deinit(void);
static stm32ee_result_t s_stm32ee_wp_enable(void);
static stm32ee_result_t s_stm32ee_wp_disable(void);

static stm32ee_result_t s_stm32ee_i2c_prepare_data(const stm32ee_i2c_cfg_t *i2ccfg, const uint8_t usefloatingpins);

static void s_stm32ee_i2c_gpio_init(void);
static void s_stm32ee_dma_init(void);
static void s_stm32ee_i2c_enable(void);
static void s_stm32ee_dma_i2c_enable(void);

static void s_stm32ee_i2c_disable(void);
static void s_stm32ee_i2c_gpio_deinit(void);
static void s_stm32ee_dma_deinit(void);


