robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/utils/stm32ee.c
static stm32ee_result_t s_stm32ee_verify_rw_bounds(uint32_t address, uint32_t *size, uint8_t* buffer);

static stm32ee_result_t s_stm32_readbuffer(uint8_t* pBuffer, uint16_t ReadAddr, uint16_t* NumByteToRead);
static stm32ee_result_t s_stm32ee_writepage(uint8_t* pBuffer, uint16_t WriteAddr, uint16_t* NumByteToWrite);

static stm32ee_result_t s_stm32ee_writebuffer(uint8_t* pBuffer, uint16_t WriteAddr, uint16_t NumByteToWrite);
static stm32ee_result_t s_stm32ee_timeoutexpired(void);
static stm32ee_result_t s_stm32ee_waiteepromstandbystate(void);

static void s_stm32ee_dma_config_tx(uint32_t pBuffer, uint32_t BufferSize);

static void s_stm32ee_dma_config_rx(uint32_t pBuffer, uint32_t BufferSize);

// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of static variables
// --------------------------------------------------------------------------------------------------------------------


static stm32ee_generic_container_t s_stm32ee_generics = 
{
    .initted                    = 0,
    .hwaddress                  = 0xA0,
    .pagesize                   = 4,
    .totalsize                  = 0,
    .cfg                        =
    {
        .devcfg                 =
        {
            .device                 = stm32ee_device_none, 
            .i2cport                = 1, 
            .hwaddra2a1a0           = (0 << 2) | (0 << 1) | (0 << 0),
            .wpval                  = 0,            
            .wppin                  =
            {
                .port                   = stm32ee_gpio_portNONE,
                .pin                    = stm32ee_gpio_pinNONE        
            },
            .functionontimeout      = NULL            
        },
        .i2ccfg                         =
        {
            .dontinit                       = 0,
            .i2cspeed                       = 4
        },
        .dmacfg                         =
        {
            .dontuse                        = 0
        }        
//        .i2cspeed                       = 400000,
//        .i2cextinit                     = 0,
//        .usedmatransfer                 = 0,
//        .functioni2cinit                = NULL, 
//        .parameteri2cinit               = NULL, 
//        .functioni2cdeinit              = NULL,

    },
    .i2cx                       = NULL,
    .i2cx_cfg               =
    {
        .clock                          = 0,
        .gpio_remap                     = 0,
        .gpio_remap_clock               = 0
    },
    .prt2bytes2read             = NULL,
    .prt2bytes2write            = NULL,
    .numberofbyte2writeinpage   = 0,
    .timeout                    = 0,
    .dma_cfg                    = {0},
    .dma_cfg_mirror             =
    {
        .data                           = NULL,
        .size                           = NULL,
        .dir                            = NULL
    }
};


static const I2C_InitTypeDef   s_stm32ee_i2c_cfg                 =
{
    .I2C_Mode                   = I2C_Mode_I2C,
    .I2C_DutyCycle              = I2C_DutyCycle_2,
    .I2C_OwnAddress1            = 0,
    .I2C_Ack                    = I2C_Ack_Enable,
    .I2C_AcknowledgedAddress    = I2C_AcknowledgedAddress_7bit,
    .I2C_ClockSpeed             = 400000            // PARAMETER
};


#if     defined(USE_STM32F1)

static const uint32_t s_stm32ee_i2c_gpio_thegpioclocks[]    = { RCC_APB2Periph_GPIOA, RCC_APB2Periph_GPIOB, RCC_APB2Periph_GPIOC, 
                                                                RCC_APB2Periph_GPIOD, RCC_APB2Periph_GPIOE, RCC_APB2Periph_GPIOF, 
                                                                RCC_APB2Periph_GPIOG };  
static const GPIO_TypeDef* s_stm32ee_i2c_gpio_thegpioports[]= { GPIOA, GPIOB, GPIOC, 
                                                                GPIOD, GPIOE, GPIOF, 
                                                                GPIOG };  
static const uint8_t  s_stm32ee_i2c_gpio_thepinnums[]       = { 0,  1,  2,  3,
                                                                4,  5,  6,  7,
                                                                8,  9,  10, 11,
                                                                12, 13, 14, 15 }; 
static const uint16_t  s_stm32ee_i2c_gpio_thepins[]         = { GPIO_Pin_0,  GPIO_Pin_1,  GPIO_Pin_2,  GPIO_Pin_3,
                                                                GPIO_Pin_4,  GPIO_Pin_5,  GPIO_Pin_6,  GPIO_Pin_7,
                                                                GPIO_Pin_8,  GPIO_Pin_9,  GPIO_Pin_10, GPIO_Pin_11,
                                                                GPIO_Pin_12, GPIO_Pin_13, GPIO_Pin_14, GPIO_Pin_15 }; 
                                                                
 
static const GPIO_InitTypeDef  s_stm32ee_i2c_gpio_sxx_pin  =
{
    .GPIO_Pin       = GPIO_Pin_All,
    .GPIO_Speed     = GPIO_Speed_50MHz,
    .GPIO_Mode      = GPIO_Mode_AF_OD,
}; 

static const GPIO_InitTypeDef  s_stm32ee_i2c_gpio_sxx_floatpin  =
{
    .GPIO_Pin       = GPIO_Pin_All,
    .GPIO_Speed     = GPIO_Speed_2MHz,
    .GPIO_Mode      = GPIO_Mode_IN_FLOATING,
}; 
    
#elif   defined(USE_STM32F4)

static const uint32_t s_stm32ee_i2c_gpio_thegpioclocks[]    = { RCC_AHB1Periph_GPIOA, RCC_AHB1Periph_GPIOB, RCC_AHB1Periph_GPIOC, 
                                                                RCC_AHB1Periph_GPIOD, RCC_AHB1Periph_GPIOE, RCC_AHB1Periph_GPIOF, 
                                                                RCC_AHB1Periph_GPIOG, RCC_AHB1Periph_GPIOH, RCC_AHB1Periph_GPIOI };  
static const GPIO_TypeDef* s_stm32ee_i2c_gpio_thegpioports[]= { GPIOA, GPIOB, GPIOC, 
                                                                GPIOD, GPIOE, GPIOF, 
                                                                GPIOG, GPIOH, GPIOI };  
static const uint8_t  s_stm32ee_i2c_gpio_thepinnums[]       = { GPIO_PinSource0,  GPIO_PinSource1,  GPIO_PinSource2,  GPIO_PinSource3,
                                                                GPIO_PinSource4,  GPIO_PinSource5,  GPIO_PinSource6,  GPIO_PinSource7,
                                                                GPIO_PinSource8,  GPIO_PinSource9,  GPIO_PinSource10, GPIO_PinSource11,
                                                                GPIO_PinSource12, GPIO_PinSource13, GPIO_PinSource14, GPIO_PinSource15 }; 
static const uint16_t  s_stm32ee_i2c_gpio_thepins[]         = { GPIO_Pin_0,  GPIO_Pin_1,  GPIO_Pin_2,  GPIO_Pin_3,
                                                                GPIO_Pin_4,  GPIO_Pin_5,  GPIO_Pin_6,  GPIO_Pin_7,
                                                                GPIO_Pin_8,  GPIO_Pin_9,  GPIO_Pin_10, GPIO_Pin_11,
                                                                GPIO_Pin_12, GPIO_Pin_13, GPIO_Pin_14, GPIO_Pin_15 }; 
                                                                
 
static const GPIO_InitTypeDef  s_stm32ee_i2c_gpio_sxx_pin  =
{
    .GPIO_Pin       = GPIO_Pin_All,
    .GPIO_Mode      = GPIO_Mode_AF,
    .GPIO_Speed     = GPIO_Speed_50MHz,
    .GPIO_OType     = GPIO_OType_OD,
    .GPIO_PuPd      = GPIO_PuPd_NOPULL
}; 

