robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/utils/stm32ee.c
static const GPIO_InitTypeDef  s_stm32ee_i2c_gpio_sxx_floatpin  =
{
    .GPIO_Pin       = GPIO_Pin_All,
    .GPIO_Mode      = GPIO_Mode_IN,
    .GPIO_Speed     = GPIO_Speed_2MHz,
    .GPIO_OType     = GPIO_OType_PP,
    .GPIO_PuPd      = GPIO_PuPd_NOPULL
}; 

#endif

// --------------------------------------------------------------------------------------------------------------------
// - definition of extern public functions
// --------------------------------------------------------------------------------------------------------------------

extern stm32ee_result_t stm32ee_init(const stm32ee_cfg_t *cfg)
{
    stm32ee_result_t res = stm32ee_res_NOK;
    
    if(NULL == cfg)
    {
        cfg = &stm32_cfg_default;
    }
    
    if((stm32ee_device_none == cfg->devcfg.device) || (stm32ee_device_none != s_stm32ee_generics.cfg.devcfg.device))
    {
        return(stm32ee_res_NOK);
    }
    
    // it can be only port 1 (so far)
    if(1 != cfg->devcfg.i2cport)
    {
        return(stm32ee_res_NOK);
    }
    
    if(0 == cfg->i2ccfg.dontinit)
    {   // must verify i2c cfg values
        if((1 != cfg->i2ccfg.i2cspeed) && (4 != cfg->i2ccfg.i2cspeed))
        {
            return(stm32ee_res_NOK);
        } 
    }
    
    
    // do other controls over cfg ....
    
    
    // ok, cfg is good. i copy it into ...
    
    memcpy(&s_stm32ee_generics.cfg, cfg, sizeof(stm32ee_cfg_t));
    
    
    // init some data
    if(1 == s_stm32ee_generics.cfg.devcfg.i2cport)
    {
        s_stm32ee_generics.i2cx                         = (I2C_TypeDef*)stm32ee_hid_i2cx_port[s_stm32ee_generics.cfg.devcfg.i2cport-1];
        s_stm32ee_generics.i2cx_cfg.clock               = stm32ee_hid_i2cx_clock[s_stm32ee_generics.cfg.devcfg.i2cport-1];
        s_stm32ee_generics.i2cx_cfg.gpio_remap          = stm32ee_hid_i2cx_gpio_remap[s_stm32ee_generics.cfg.devcfg.i2cport-1];
        s_stm32ee_generics.i2cx_cfg.gpio_remap_clock    = stm32ee_hid_i2cx_gpio_remap_clock[s_stm32ee_generics.cfg.devcfg.i2cport-1];
    }
    else
    {
        return(stm32ee_res_NOK);
    }
    
    // init the generics according to the device
    
    switch(s_stm32ee_generics.cfg.devcfg.device)
    {
        case stm32ee_device_st_m24lr64:
        {
            s_stm32ee_generics.hwaddress     = 0xA0;    // poi si devono mettere a posto i bit meno significativi a seconda dei casi
            s_stm32ee_generics.pagesize      = 4;   
            s_stm32ee_generics.totalsize     = 8*1024;
        } break;
        
        case stm32ee_device_st_m24c64:
        {
            s_stm32ee_generics.hwaddress     = 0xA0;    // poi si devono mettere a posto i bit meno significativi a seconda dei casi
            s_stm32ee_generics.pagesize      = 32; 
            s_stm32ee_generics.totalsize     = 8*1024;
        } break;
        
        case stm32ee_device_st_m24512:
        {
            s_stm32ee_generics.hwaddress     = 0xA0;    // poi si devono mettere a posto i bit meno significativi a seconda dei casi
            s_stm32ee_generics.pagesize      = 128;
            s_stm32ee_generics.totalsize     = 64*1024;            
        } break;
        
        case stm32ee_device_atmel_at24c512b:
        {
            s_stm32ee_generics.hwaddress     = 0xA0;    // poi si devono mettere a posto i bit meno significativi a seconda dei casi
            s_stm32ee_generics.pagesize      = 128;  
            s_stm32ee_generics.totalsize     = 64*1024;
        } break;
        
        case stm32ee_device_atmel_at24c1024b:
        {
            s_stm32ee_generics.hwaddress     = 0xA0;    // poi si devono mettere a posto i bit meno significativi a seconda dei casi
            s_stm32ee_generics.pagesize      = 256;
            s_stm32ee_generics.totalsize     = 128*1024;            
        } break;
        
        default:
        {
            s_stm32ee_generics.hwaddress     = 0xA0;    // poi si devono mettere a posto i bit meno significativi a seconda dei casi
            s_stm32ee_generics.pagesize      = 4;  
            s_stm32ee_generics.totalsize     = 8*1024;            
        } break;
    }
    
    // apply extra bits
    s_stm32ee_generics.hwaddress |= ((s_stm32ee_generics.cfg.devcfg.hwaddra2a1a0 & 0x07) << 1);
    
    // init wp if needed
    if((stm32ee_gpio_portNONE != s_stm32ee_generics.cfg.devcfg.wppin.port) && (stm32ee_gpio_pinNONE != s_stm32ee_generics.cfg.devcfg.wppin.pin) && ((255 != s_stm32ee_generics.cfg.devcfg.wpval)))
    {
        s_stm32ee_wp_init();
        s_stm32ee_wp_enable();    
    }
    
    
    // init i2c if needed
    if(0 == s_stm32ee_generics.cfg.i2ccfg.dontinit)
    {
        res = s_stm32ee_i2c_common_init(&s_stm32ee_generics.cfg.i2ccfg);
        if(stm32ee_res_NOK == res)
        {
            return(stm32ee_res_NOK);
        }
    }
    
    // init dma if needed
    if(0 == s_stm32ee_generics.cfg.dmacfg.dontuse)
    {
        s_stm32ee_dma_init();
        s_stm32ee_dma_i2c_enable();
    }    
 
 

    s_stm32ee_generics.initted  = 1;    
        
    return(stm32ee_res_OK);
}


extern stm32ee_result_t stm32ee_deinit(const stm32ee_cfg_t *cfg)
{
    if(NULL == cfg)
    {
        cfg = &stm32_cfg_default;
    }
    
    if(0 == cfg->i2ccfg.dontinit)
    {
        s_stm32ee_i2c_common_deinit(&cfg->i2ccfg);
    }
    
    s_stm32ee_dma_deinit(); // always deinit
    
    
    return(stm32ee_res_OK);
}


extern stm32ee_result_t stm32ee_read(uint32_t address, uint32_t size, uint8_t* buffer, uint32_t* readbytes)
{   // read and block until done
    stm32ee_result_t res = stm32ee_res_NOK;
    
    if(0 == s_stm32ee_generics.initted)
    {
        return(stm32ee_res_NOK);
    }
    
    // verify bounds and ... clip size to maximum possible if address+size is out of bound
    if(stm32ee_res_NOK == s_stm32ee_verify_rw_bounds(address, &size, buffer))
    {
        return(stm32ee_res_NOK);
    }
    
    
    uint16_t ReadAddr = (uint16_t) address;
    uint16_t NumByteToRead = (uint16_t) size;
    res = s_stm32_readbuffer(buffer, ReadAddr, &NumByteToRead);
    
    if(NULL != readbytes)
    {
        *readbytes = (stm32ee_res_OK == res) ? (size) : (0);
    }
    
