robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/utils/stm32ee.c
    return(res);
}


extern stm32ee_result_t stm32ee_write(uint32_t address, uint32_t size, uint8_t* buffer, uint32_t* writtenbytes)
{   // read and block until done
    stm32ee_result_t res = stm32ee_res_NOK;
    
    if(0 == s_stm32ee_generics.initted)
    {
        return(stm32ee_res_NOK);
    }
    
    // verify bounds and ... clip size to maximum possible if address+size is out of bound
    if(stm32ee_res_NOK == s_stm32ee_verify_rw_bounds(address, &size, buffer))
    {
        return(stm32ee_res_NOK);
    } 
    
    
    s_stm32ee_wp_disable();

    uint16_t WriteAddr = (uint16_t) address;
    uint16_t NumByteToWrite = (uint16_t) size;
    res = s_stm32ee_writebuffer(buffer, WriteAddr, NumByteToWrite);
    
    
    s_stm32ee_wp_enable();

    if(NULL != writtenbytes)
    {
        *writtenbytes = (stm32ee_res_OK == res) ? (size) : (0);
    }
    
    return(res);   
}




// --------------------------------------------------------------------------------------------------------------------
// - definition of extern hidden functions 
// --------------------------------------------------------------------------------------------------------------------


// ---- isr of the module: begin ----

#if     defined(USE_STM32F1)

void stm32ee_hid_dma_I2C_DMA_TX_IRQHandler(void)
{
    /* Check if the DMA transfer is complete */ 
    if(DMA_GetFlagStatus(stm32ee_hid_dma_flags_tx_completed) != RESET)
    {  
        /* Disable the DMA Tx Channel and Clear all its Flags */  
        DMA_Cmd(stm32ee_hid_dma_stream_tx, DISABLE);
        DMA_ClearFlag(stm32ee_hid_dma_flags_tx_all);

        /*!< Wait till all data have been physically transferred on the bus */
        s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
        while(!I2C_GetFlagStatus(s_stm32ee_generics.i2cx, I2C_FLAG_BTF))
        {
            if((s_stm32ee_generics.timeout--) == 0) s_stm32ee_timeoutexpired();
        }
    
        /*!< Send STOP condition */
        I2C_GenerateSTOP(s_stm32ee_generics.i2cx, ENABLE);
    
        /* Perform a read on SR1 and SR2 register to clear eventualaly pending flags */
        (void)(s_stm32ee_generics.i2cx)->SR1;
        (void)(s_stm32ee_generics.i2cx)->SR2;
    
        /* Reset the variable holding the number of data to be written */
        *s_stm32ee_generics.prt2bytes2write = 0;  
    }
}

void stm32ee_hid_dma_I2C_DMA_RX_IRQHandler(void)
{
    /* Check if the DMA transfer is complete */
    if(DMA_GetFlagStatus(stm32ee_hid_dma_flags_rx_completed) != RESET)
    {      
        /*!< Send STOP Condition */
        I2C_GenerateSTOP(s_stm32ee_generics.i2cx, ENABLE);    
    
        /* Disable the DMA Rx Channel and Clear all its Flags */  
        DMA_Cmd(stm32ee_hid_dma_stream_rx, DISABLE);
        DMA_ClearFlag(stm32ee_hid_dma_flags_rx_all);
    
        /* Reset the variable holding the number of data to be read */
        *s_stm32ee_generics.prt2bytes2read = 0;
    }
}

#elif   defined(USE_STM32F4)

void stm32ee_hid_dma_I2C_DMA_TX_IRQHandler(void)
{
    /* Check if the DMA transfer is complete */
    if(DMA_GetFlagStatus(stm32ee_hid_dma_stream_tx, stm32ee_hid_dma_flags_tx_completed) != RESET)
    {  
        /* Disable the DMA Tx Stream and Clear TC flag */  
        DMA_Cmd(stm32ee_hid_dma_stream_tx, DISABLE);
        DMA_ClearFlag(stm32ee_hid_dma_stream_tx, stm32ee_hid_dma_flags_tx_completed);

        /*!< Wait till all data have been physically transferred on the bus */
        s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
        while(!I2C_GetFlagStatus(s_stm32ee_generics.i2cx, I2C_FLAG_BTF))
        {
            if((s_stm32ee_generics.timeout--) == 0) s_stm32ee_timeoutexpired();
        }
    
        /*!< Send STOP condition */
        I2C_GenerateSTOP(s_stm32ee_generics.i2cx, ENABLE);
        
        /* Perform a read on SR1 and SR2 register to clear eventually pending flags */
        (void)(s_stm32ee_generics.i2cx)->SR1;
        (void)(s_stm32ee_generics.i2cx)->SR2;
    
        /* Reset the variable holding the number of data to be written */
        *s_stm32ee_generics.prt2bytes2write = 0;  
    }
}

void stm32ee_hid_dma_I2C_DMA_RX_IRQHandler(void)
{
    /* Check if the DMA transfer is complete */
    if(DMA_GetFlagStatus(stm32ee_hid_dma_stream_rx, stm32ee_hid_dma_flags_rx_completed) != RESET)
    {      
        /*!< Send STOP Condition */
        I2C_GenerateSTOP(s_stm32ee_generics.i2cx, ENABLE);    
    
        /* Disable the DMA Rx Stream and Clear TC Flag */  
        DMA_Cmd(stm32ee_hid_dma_stream_rx, DISABLE);
        DMA_ClearFlag(stm32ee_hid_dma_stream_rx, stm32ee_hid_dma_flags_rx_completed);
    
        /* Reset the variable holding the number of data to be read */
        *s_stm32ee_generics.prt2bytes2read = 0;
    }
}

#endif 

// ---- isr of the module: end ------


//extern uint32_t stm32ee_hid_myfunction(void)
//{
//}



// --------------------------------------------------------------------------------------------------------------------
// - definition of static functions 
// --------------------------------------------------------------------------------------------------------------------

//static uint32_t s_stm32ee_dosomething(void)
//{
//    return(0x12345678);
//}

static void hal_delay(uint32_t microsecs)
{
    volatile uint32_t i;
    uint32_t cnt = 72*microsecs;

    for(i = cnt; i; i--);
}
    
    

static void s_stm32ee_i2c_software_reset(void)
{
    // implementare la sequenza di sw reset
    
    // forse puo' essere utile usare I2C_GetFlagStatus(I2Cx, I2C_FLAG_BUSY) per verificare qsa.
    // vedi: https://my.st.com/public/STe2ecommunities/mcu/Lists/cortex_mx_stm32/Flat.aspx?RootFolder=%2Fpublic%2FSTe2ecommunities%2Fmcu%2FLists%2Fcortex_mx_stm32%2FI2C%20Unable%20to%20receive%20start%20state%20%28EV5%29&FolderCTID=0x01200200770978C69A1141439FE559EB459D7580009C4E14902C3CDE46A77F0FFD06506F5B&currentviews=2461
    
    
}

static stm32ee_result_t s_stm32ee_i2c_prepare_data(const stm32ee_i2c_cfg_t *i2ccfg, const uint8_t usefloatingpins)
{
#if 0
    const GPIO_InitTypeDef* pin = NULL;
    
    s_stm32ee_generics.i2c_gpio_scl.clock   = stm32ee_hid_i2c_gpio_scl_clock;
    s_stm32ee_generics.i2c_gpio_scl.port    = (GPIO_TypeDef*)stm32ee_hid_i2c_gpio_scl_port;
    s_stm32ee_generics.i2c_gpio_scl.pinnum  = stm32ee_hid_i2c_gpio_scl_pinnum;
    pin = (0 == usefloatingpins) ? (&stm32ee_hid_i2c_gpio_scl_pin) : (&stm32ee_hid_i2c_gpio_scl_floatingpin);
    memcpy(&s_stm32ee_generics.i2c_gpio_scl.pin, pin, sizeof(GPIO_InitTypeDef));

        
