robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/utils/stm32ee.c
    #warning --> change the pin, pinnum, port, clock of scl depending on cfg.
    
    s_stm32ee_generics.i2c_gpio_sda.clock   = stm32ee_hid_i2c_gpio_sda_clock;
    s_stm32ee_generics.i2c_gpio_sda.port    = (GPIO_TypeDef*)stm32ee_hid_i2c_gpio_sda_port;
    s_stm32ee_generics.i2c_gpio_sda.pinnum  = stm32ee_hid_i2c_gpio_sda_pinnum;
    pin = (0 == usefloatingpins) ? (&stm32ee_hid_i2c_gpio_sda_pin) : (&stm32ee_hid_i2c_gpio_sda_floatingpin);
    memcpy(&s_stm32ee_generics.i2c_gpio_sda.pin, pin, sizeof(GPIO_InitTypeDef));
    #warning --> change the pin, pinnum, port, clock of sda depending on cfg.

#else

    const GPIO_InitTypeDef* pin = NULL;
    
    s_stm32ee_generics.i2c_gpio_scl.clock   = s_stm32ee_i2c_gpio_thegpioclocks[i2ccfg->scl.port];
    s_stm32ee_generics.i2c_gpio_scl.port    = (GPIO_TypeDef*)s_stm32ee_i2c_gpio_thegpioports[i2ccfg->scl.port];
    s_stm32ee_generics.i2c_gpio_scl.pinnum  = s_stm32ee_i2c_gpio_thepinnums[i2ccfg->scl.pin];
    pin = (0 == usefloatingpins) ? (&s_stm32ee_i2c_gpio_sxx_pin) : (&s_stm32ee_i2c_gpio_sxx_floatpin);
    memcpy(&s_stm32ee_generics.i2c_gpio_scl.pin, pin, sizeof(GPIO_InitTypeDef));
    s_stm32ee_generics.i2c_gpio_scl.pin.GPIO_Pin = s_stm32ee_i2c_gpio_thepins[i2ccfg->scl.pin];
        
    s_stm32ee_generics.i2c_gpio_sda.clock   = s_stm32ee_i2c_gpio_thegpioclocks[i2ccfg->sda.port];
    s_stm32ee_generics.i2c_gpio_sda.port    = (GPIO_TypeDef*)s_stm32ee_i2c_gpio_thegpioports[i2ccfg->sda.port];
    s_stm32ee_generics.i2c_gpio_sda.pinnum  = s_stm32ee_i2c_gpio_thepinnums[i2ccfg->sda.pin];
    pin = (0 == usefloatingpins) ? (&s_stm32ee_i2c_gpio_sxx_pin) : (&s_stm32ee_i2c_gpio_sxx_floatpin);
    memcpy(&s_stm32ee_generics.i2c_gpio_sda.pin, pin, sizeof(GPIO_InitTypeDef));
    s_stm32ee_generics.i2c_gpio_sda.pin.GPIO_Pin = s_stm32ee_i2c_gpio_thepins[i2ccfg->sda.pin];


#endif    
    return(stm32ee_res_OK);
}

static stm32ee_result_t s_stm32ee_i2c_common_init(const stm32ee_i2c_cfg_t *i2ccfg)
{
    const uint8_t usefloatingpins = 0;
    if(stm32ee_res_NOK == s_stm32ee_i2c_prepare_data(i2ccfg, usefloatingpins))
    {
        return(stm32ee_res_NOK);
    }
    
    s_stm32ee_i2c_gpio_init();
    s_stm32ee_i2c_enable();
    
    return(stm32ee_res_OK);
}


static stm32ee_result_t s_stm32ee_i2c_common_deinit(const stm32ee_i2c_cfg_t *i2ccfg)
{

    const uint8_t usefloatingpins = 1;
    if(stm32ee_res_NOK == s_stm32ee_i2c_prepare_data(i2ccfg, usefloatingpins))
    {
        return(stm32ee_res_NOK);
    }
    s_stm32ee_i2c_disable();
    s_stm32ee_i2c_gpio_deinit();
    
    return(stm32ee_res_OK);
}


static stm32ee_result_t s_stm32ee_wp_init(void)
{

    return(stm32ee_res_OK);
}

static stm32ee_result_t s_stm32ee_wp_deinit(void)
{

    return(stm32ee_res_OK);
}

static stm32ee_result_t s_stm32ee_wp_enable(void)
{
    if(255 != s_stm32ee_generics.cfg.devcfg.wpval)
    {
        // set s_stm32ee_generics.cfg.wppin to value equal to 1 if s_stm32ee_generics.cfg.wpval is 1, else 0
    }
 
    return(stm32ee_res_OK);
}

static stm32ee_result_t s_stm32ee_wp_disable(void)
{
    if(255 != s_stm32ee_generics.cfg.devcfg.wpval)
    {
        // set s_stm32ee_generics.cfg.wppin to value equal to 0 if s_stm32ee_generics.cfg.wpval is 1, else 1
    }
    return(stm32ee_res_OK);
}

static void s_stm32ee_i2c_gpio_init(void)
{   
#if     defined(USE_STM32F1)
    
    // i2c periph clock enable
    RCC_APB1PeriphClockCmd(s_stm32ee_generics.i2cx_cfg.clock, ENABLE);
    
    // sda and scl periph clock enable
    RCC_APB2PeriphClockCmd(s_stm32ee_generics.i2c_gpio_scl.clock | s_stm32ee_generics.i2c_gpio_sda.clock, ENABLE);

    // afio periph clock enable
    RCC_APB2PeriphClockCmd(s_stm32ee_generics.i2cx_cfg.gpio_remap_clock, ENABLE);
    
    // reset i2c input
    RCC_APB1PeriphResetCmd(s_stm32ee_generics.i2cx_cfg.clock, ENABLE);
  
    // release reset signal for i2c input
    RCC_APB1PeriphResetCmd(s_stm32ee_generics.i2cx_cfg.clock, DISABLE);
    
    // i2c remapping   
    GPIO_PinRemapConfig(s_stm32ee_generics.i2cx_cfg.gpio_remap, ENABLE);    
        
    // configure gpio for scl
    GPIO_Init((GPIO_TypeDef*)s_stm32ee_generics.i2c_gpio_scl.port, (GPIO_InitTypeDef*)&s_stm32ee_generics.i2c_gpio_scl.pin);
    
    // configure gpio for sda
    GPIO_Init((GPIO_TypeDef*)s_stm32ee_generics.i2c_gpio_sda.port, (GPIO_InitTypeDef*)&s_stm32ee_generics.i2c_gpio_sda.pin);    
    
#elif   defined(USE_STM32F4)    

    // i2c periph clock enable
    RCC_APB1PeriphClockCmd(s_stm32ee_generics.i2cx_cfg.clock, ENABLE);
    
    // sda and scl periph clock enable
    RCC_AHB1PeriphClockCmd(s_stm32ee_generics.i2c_gpio_scl.clock | s_stm32ee_generics.i2c_gpio_sda.clock, ENABLE);

    // afio periph clock enable
    RCC_APB2PeriphClockCmd(s_stm32ee_generics.i2cx_cfg.gpio_remap_clock, ENABLE);
    
    // reset i2c input
    RCC_APB1PeriphResetCmd(s_stm32ee_generics.i2cx_cfg.clock, ENABLE);
  
    // release reset signal for i2c input
    RCC_APB1PeriphResetCmd(s_stm32ee_generics.i2cx_cfg.clock, DISABLE);
    
    // i2c remapping     
    GPIO_PinAFConfig((GPIO_TypeDef*)s_stm32ee_generics.i2c_gpio_scl.port, s_stm32ee_generics.i2c_gpio_scl.pinnum, s_stm32ee_generics.i2cx_cfg.gpio_remap);
    GPIO_PinAFConfig((GPIO_TypeDef*)s_stm32ee_generics.i2c_gpio_sda.port, s_stm32ee_generics.i2c_gpio_sda.pinnum, s_stm32ee_generics.i2cx_cfg.gpio_remap); 
        
    // configure gpio for scl
    GPIO_Init((GPIO_TypeDef*)s_stm32ee_generics.i2c_gpio_scl.port, (GPIO_InitTypeDef*)&s_stm32ee_generics.i2c_gpio_scl.pin);
    
    // configure gpio for sda
    GPIO_Init((GPIO_TypeDef*)s_stm32ee_generics.i2c_gpio_sda.port, (GPIO_InitTypeDef*)&s_stm32ee_generics.i2c_gpio_sda.pin);    
    
#endif

}

static void s_stm32ee_i2c_enable(void)
{
#if     defined(USE_STM32F1) || defined(USE_STM32F4)  

    I2C_InitTypeDef i2c_cfg;
    memcpy(&i2c_cfg, &s_stm32ee_i2c_cfg, sizeof(I2C_InitTypeDef));
    // apply the clockspeed 
    i2c_cfg.I2C_ClockSpeed = 100000 * s_stm32ee_generics.cfg.i2ccfg.i2cspeed;
    // i2c peripheral enable
    I2C_Cmd(s_stm32ee_generics.i2cx, ENABLE);
    // apply configuration
    I2C_Init(s_stm32ee_generics.i2cx, &i2c_cfg);
     
#endif
}


static void s_stm32ee_dma_init(void)
{
#if defined(USE_STM32F4)

