robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/utils/stm32ee.c
    // init nvic for dma tx and rx
    NVIC_Init((NVIC_InitTypeDef*)&stm32ee_hid_dma_nvic_tx_enable);
    NVIC_Init((NVIC_InitTypeDef*)&stm32ee_hid_dma_nvic_rx_enable);
    
    // enable dma clock
    RCC_AHB1PeriphClockCmd(stm32ee_hid_dma_clock, ENABLE);
    
    
    // clear pending flags on tx
    DMA_ClearFlag(stm32ee_hid_dma_stream_tx, stm32ee_hid_dma_flags_tx);
    // Disable the EE I2C Tx DMA stream 
    DMA_Cmd(stm32ee_hid_dma_stream_tx, DISABLE);
    
    // Configure the DMA stream for the EE I2C peripheral TX direction 
    DMA_DeInit(stm32ee_hid_dma_stream_tx);
    memcpy(&s_stm32ee_generics.dma_cfg, &stm32ee_hid_dma_cfg_init, sizeof(DMA_InitTypeDef));
    s_stm32ee_generics.dma_cfg_mirror.data         = &s_stm32ee_generics.dma_cfg.DMA_Memory0BaseAddr;
    s_stm32ee_generics.dma_cfg_mirror.size         = &s_stm32ee_generics.dma_cfg.DMA_BufferSize;
    s_stm32ee_generics.dma_cfg_mirror.dir          = &s_stm32ee_generics.dma_cfg.DMA_DIR;
    DMA_Init(stm32ee_hid_dma_stream_tx, (DMA_InitTypeDef*)&stm32ee_hid_dma_cfg_init);    

    
    // clear pending flags on rx
    DMA_ClearFlag(stm32ee_hid_dma_stream_rx, stm32ee_hid_dma_flags_rx);
    /* Disable the EE I2C DMA Rx stream */
    DMA_Cmd(stm32ee_hid_dma_stream_rx, DISABLE);
    
    /* Configure the DMA stream for the EE I2C peripheral RX direction */
    DMA_DeInit(stm32ee_hid_dma_stream_rx);
    DMA_Init(stm32ee_hid_dma_stream_rx, (DMA_InitTypeDef*)&stm32ee_hid_dma_cfg_init);
    
    /* Enable the DMA Channels Interrupts */
    DMA_ITConfig(stm32ee_hid_dma_stream_tx, DMA_IT_TC, ENABLE);
    DMA_ITConfig(stm32ee_hid_dma_stream_rx, DMA_IT_TC, ENABLE);  
    

#elif   defined(USE_STM32F1)

    // init nvic for dma tx and rx
    NVIC_Init((NVIC_InitTypeDef*)&stm32ee_hid_dma_nvic_tx_enable);
    NVIC_Init((NVIC_InitTypeDef*)&stm32ee_hid_dma_nvic_rx_enable);
    
    // enable dma clock
    RCC_AHBPeriphClockCmd(stm32ee_hid_dma_clock, ENABLE);
    

//    // clear pending flags on tx
//    DMA_ClearFlag(stm32ee_hid_dma_stream_tx, stm32ee_hid_dma_flags_tx);
//    // Disable the EE I2C Tx DMA stream 
//    DMA_Cmd(stm32ee_hid_dma_stream_tx, DISABLE);
    
    // Configure the DMA stream for the EE I2C peripheral TX direction 
    DMA_DeInit(stm32ee_hid_dma_stream_tx);
    memcpy(&s_stm32ee_generics.dma_cfg, &stm32ee_hid_dma_cfg_init, sizeof(DMA_InitTypeDef));
    s_stm32ee_generics.dma_cfg_mirror.data         = &s_stm32ee_generics.dma_cfg.DMA_MemoryBaseAddr;
    s_stm32ee_generics.dma_cfg_mirror.size         = &s_stm32ee_generics.dma_cfg.DMA_BufferSize;
    s_stm32ee_generics.dma_cfg_mirror.dir          = &s_stm32ee_generics.dma_cfg.DMA_DIR;
    DMA_Init(stm32ee_hid_dma_stream_tx, (DMA_InitTypeDef*)&stm32ee_hid_dma_cfg_init);    

    
//    // clear pending flags on rx
//    DMA_ClearFlag(stm32ee_hid_dma_stream_rx, stm32ee_hid_dma_flags_rx);
//    /* Disable the EE I2C DMA Rx stream */
//    DMA_Cmd(stm32ee_hid_dma_stream_rx, DISABLE);
    
    /* Configure the DMA stream for the EE I2C peripheral RX direction */
    DMA_DeInit(stm32ee_hid_dma_stream_rx);
    DMA_Init(stm32ee_hid_dma_stream_rx, (DMA_InitTypeDef*)&stm32ee_hid_dma_cfg_init);
    
    /* Enable the DMA Channels Interrupts */
    DMA_ITConfig(stm32ee_hid_dma_stream_tx, DMA_IT_TC, ENABLE);
    DMA_ITConfig(stm32ee_hid_dma_stream_rx, DMA_IT_TC, ENABLE);  
        


#endif
}

static void s_stm32ee_i2c_disable(void)
{   
#if     defined(USE_STM32F1) || defined(USE_STM32F4)    

    // i2c disable
    I2C_Cmd(s_stm32ee_generics.i2cx, DISABLE);
 
    // i2c deinit
    I2C_DeInit(s_stm32ee_generics.i2cx);

    // i2c clock disable
    RCC_APB1PeriphClockCmd(s_stm32ee_generics.i2cx_cfg.clock, DISABLE);

#endif    
}

static void s_stm32ee_i2c_gpio_deinit(void)
{ 
#if 0    
#if     defined(USE_STM32F1) || defined(USE_STM32F4)
    // configure scl and sda as floating pin
    GPIO_Init((GPIO_TypeDef*)s_stm32ee_generics.i2c_gpio_scl.port, (GPIO_InitTypeDef*)&stm32ee_hid_i2c_gpio_scl_floatingpin);
    GPIO_Init((GPIO_TypeDef*)s_stm32ee_generics.i2c_gpio_sda.port, (GPIO_InitTypeDef*)&stm32ee_hid_i2c_gpio_sda_floatingpin); 
#endif
#else
#if     defined(USE_STM32F1) || defined(USE_STM32F4)
    // configure scl and sda as floating pin using values filled beforehands in i2c_gpio_scl and i2c_gpio_sda
    GPIO_Init((GPIO_TypeDef*)s_stm32ee_generics.i2c_gpio_scl.port, (GPIO_InitTypeDef*)&s_stm32ee_generics.i2c_gpio_scl.pin);
    GPIO_Init((GPIO_TypeDef*)s_stm32ee_generics.i2c_gpio_sda.port, (GPIO_InitTypeDef*)&s_stm32ee_generics.i2c_gpio_sda.pin); 
#endif    
#endif
}

static void s_stm32ee_dma_deinit(void)
{   
#if     defined(USE_STM32F1) || defined(USE_STM32F4)  

    // disable tx and rx dma interrupts
    NVIC_Init((NVIC_InitTypeDef*)&stm32ee_hid_dma_nvic_tx_disable);
    NVIC_Init((NVIC_InitTypeDef*)&stm32ee_hid_dma_nvic_rx_disable);

    // disable and deinitialise the dma streams
    DMA_Cmd(stm32ee_hid_dma_stream_tx, DISABLE);
    DMA_Cmd(stm32ee_hid_dma_stream_rx, DISABLE);
    DMA_DeInit(stm32ee_hid_dma_stream_tx);
    DMA_DeInit(stm32ee_hid_dma_stream_rx);

#endif
}



static void s_stm32ee_dma_i2c_enable(void)
{
    I2C_DMACmd(s_stm32ee_generics.i2cx, ENABLE);  
}

static void s_stm32ee_dma_config_tx(uint32_t pBuffer, uint32_t BufferSize)
{ 
    *s_stm32ee_generics.dma_cfg_mirror.data    = (uint32_t)pBuffer;
    *s_stm32ee_generics.dma_cfg_mirror.size    = BufferSize;
    *s_stm32ee_generics.dma_cfg_mirror.dir     = STM32EE_dma_dir_MEMORY2PERIPHERAL;
    
    DMA_Init(stm32ee_hid_dma_stream_tx, &s_stm32ee_generics.dma_cfg); 
}

static void s_stm32ee_dma_config_rx(uint32_t pBuffer, uint32_t BufferSize)
{ 
    *s_stm32ee_generics.dma_cfg_mirror.data    = (uint32_t)pBuffer;
    *s_stm32ee_generics.dma_cfg_mirror.size    = BufferSize;
    *s_stm32ee_generics.dma_cfg_mirror.dir     = STM32EE_dma_dir_PERIPHERAL2MEMORY;
    
    DMA_Init(stm32ee_hid_dma_stream_rx, &s_stm32ee_generics.dma_cfg); 
}


static stm32ee_result_t s_stm32_readbuffer(uint8_t* pBuffer, uint16_t ReadAddr, uint16_t* NumByteToRead)
{  
    /*  Set the pointer to the Number of data to be read. This pointer will be used 
        by the DMA Transfer Completer interrupt Handler in order to reset the 
        variable to 0. User should check on this variable in order to know if the 
        DMA transfer has been complete or not. */
    s_stm32ee_generics.prt2bytes2read = NumByteToRead;
  
