robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/utils/stm32ee.c
    /*!< While the bus is busy */
    s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
    while(I2C_GetFlagStatus(s_stm32ee_generics.i2cx, I2C_FLAG_BUSY))
    {
        if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
    }
  
    /*!< Send START condition */
    I2C_GenerateSTART(s_stm32ee_generics.i2cx, ENABLE);

    /*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
    s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
    while(!I2C_CheckEvent(s_stm32ee_generics.i2cx, I2C_EVENT_MASTER_MODE_SELECT))
    {
        if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
    }
  
    /*!< Send EEPROM address for write */
    I2C_Send7bitAddress(s_stm32ee_generics.i2cx, s_stm32ee_generics.hwaddress, I2C_Direction_Transmitter);

    /*!< Test on EV6 and clear it */
    s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
    while(!I2C_CheckEvent(s_stm32ee_generics.i2cx, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
    {
        if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
    } 


//#elif defined (sEE_M24C64_32)

    /*!< Send the EEPROM's internal address to read from: MSB of the address first */
    I2C_SendData(s_stm32ee_generics.i2cx, (uint8_t)((ReadAddr & 0xFF00) >> 8));    

    /*!< Test on EV8 and clear it */
    s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
    while(!I2C_CheckEvent(s_stm32ee_generics.i2cx, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
    {
        if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
    }

    /*!< Send the EEPROM's internal address to read from: LSB of the address */
    I2C_SendData(s_stm32ee_generics.i2cx, (uint8_t)(ReadAddr & 0x00FF));    
  
//#endif /*!< sEE_M24C08 */

    /*!< Test on EV8 and clear it */
    s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
    while(I2C_GetFlagStatus(s_stm32ee_generics.i2cx, I2C_FLAG_BTF) == RESET)
    {
        if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
    }
  
    /*!< Send START condition a second time */  
    I2C_GenerateSTART(s_stm32ee_generics.i2cx, ENABLE);

    /*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
    s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
    while(!I2C_CheckEvent(s_stm32ee_generics.i2cx, I2C_EVENT_MASTER_MODE_SELECT))
    {
        if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
    } 
  
    /*!< Send EEPROM address for read */
    I2C_Send7bitAddress(s_stm32ee_generics.i2cx, s_stm32ee_generics.hwaddress, I2C_Direction_Receiver);  

    /* If number of data to be read is 1, then DMA couldn't be used */
    /* One Byte Master Reception procedure (POLLING) ---------------------------*/
    if ((uint16_t)(*NumByteToRead) < 2)
    {
        /* Wait on ADDR flag to be set (ADDR is still not cleared at this level */
        s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
        while(I2C_GetFlagStatus(s_stm32ee_generics.i2cx, I2C_FLAG_ADDR) == RESET)
        {
            if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
        }     

        /*!< Disable Acknowledgement */
        I2C_AcknowledgeConfig(s_stm32ee_generics.i2cx, DISABLE);   


        //#warning --> in stm32f1 they use a sEE_EnterCriticalSection_UserCallback(); it generally disalbe interrupts

        /* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
        (void)(s_stm32ee_generics.i2cx)->SR2;

        /*!< Send STOP Condition */
        I2C_GenerateSTOP(s_stm32ee_generics.i2cx, ENABLE);
            

        //#warning --> in stm32f1 they use a sEE_ExitCriticalSection_UserCallback();

        /* Wait for the byte to be received */
        s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
        while(I2C_GetFlagStatus(s_stm32ee_generics.i2cx, I2C_FLAG_RXNE) == RESET)
        {
            if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
        }

        /*!< Read the byte received from the EEPROM */
        *pBuffer = I2C_ReceiveData(s_stm32ee_generics.i2cx);

        /*!< Decrement the read bytes counter */
        (uint16_t)(*NumByteToRead)--;        

        /* Wait to make sure that STOP control bit has been cleared */
        s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
        while((s_stm32ee_generics.i2cx)->CR1 & I2C_CR1_STOP)
        {
            if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
        }  

        /*!< Re-Enable Acknowledgement to be ready for another reception */
        I2C_AcknowledgeConfig(s_stm32ee_generics.i2cx, ENABLE);    

        return(stm32ee_res_OK);
    }
    else if(0 == s_stm32ee_generics.cfg.dmacfg.dontuse) /* More than one Byte Master Reception procedure (DMA) -----------------*/
    {
        /*!< Test on EV6 and clear it */
        s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
        while(!I2C_CheckEvent(s_stm32ee_generics.i2cx, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
        {
            if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
        }  

        /* Configure the DMA Rx Channel with the buffer address and the buffer size */
        //s_stm32ee_dma_config((uint32_t)pBuffer, (uint16_t)(*NumByteToRead), sEE_DIRECTION_RX);
        s_stm32ee_dma_config_rx((uint32_t)pBuffer, (uint16_t)(*NumByteToRead));

        /* Inform the DMA that the next End Of Transfer Signal will be the last one */
        I2C_DMALastTransferCmd(s_stm32ee_generics.i2cx, ENABLE); 

        /* Enable the DMA Rx Stream */
        DMA_Cmd(stm32ee_hid_dma_stream_rx, ENABLE);  

        // and now ... waits for the dma reception
        s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
        while ((*s_stm32ee_generics.prt2bytes2read) > 0)
        {
            if((s_stm32ee_generics.timeout--) == 0) {return s_stm32ee_timeoutexpired();};
        }

    }
    else
    {   // must use transfer without dma
 
        /*!< Test on EV6 and clear it */
        s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
        while(!I2C_CheckEvent(s_stm32ee_generics.i2cx, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
        {
            if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
        }  

        while(*NumByteToRead)
        {
        
            if(1 == (*NumByteToRead))
            {
                /*!< Disable Acknowledgement */
                I2C_AcknowledgeConfig(s_stm32ee_generics.i2cx, DISABLE);          
                /* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
                (void)(s_stm32ee_generics.i2cx)->SR2;
                /*!< Send STOP Condition */
                I2C_GenerateSTOP(s_stm32ee_generics.i2cx, ENABLE);            
            }
        
            /* Wait for the byte to be received */
            s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
            while(I2C_GetFlagStatus(s_stm32ee_generics.i2cx, I2C_FLAG_RXNE) == RESET)
            {
                if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
            }
            
