robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/utils/stm32ee.c
            /*!< Read the byte received from the EEPROM */
            *pBuffer = I2C_ReceiveData(s_stm32ee_generics.i2cx);
            
            pBuffer++;
            
            /*!< Decrement the read bytes counter */
            (uint16_t)(*NumByteToRead)--;              
        
        }
    
    
        /* Wait to make sure that STOP control bit has been cleared */
        s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
        while((s_stm32ee_generics.i2cx)->CR1 & I2C_CR1_STOP)
        {
            if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
        }  
        
        /*!< Re-Enable Acknowledgement to be ready for another reception */
        I2C_AcknowledgeConfig(s_stm32ee_generics.i2cx, ENABLE);    

    }
  
    /* If all operations OK, return OK (0) */
    return stm32ee_res_OK;
}

static stm32ee_result_t s_stm32ee_verify_rw_bounds(uint32_t address, uint32_t *size, uint8_t* buffer)
{   
    if((stm32ee_device_none == s_stm32ee_generics.cfg.devcfg.device) || (NULL == buffer) || (0 == *size) || (address >= s_stm32ee_generics.totalsize))
    {
        return(stm32ee_res_NOK);
    }
    
    // clip address+size to ... s_stm32ee_generics.totalsize
    if((address+(*size)) > s_stm32ee_generics.totalsize)
    {
        uint32_t ss = address+(*size) - s_stm32ee_generics.totalsize;
        (*size) -= ss; 
    }    
 

    // so far we manage only .... lower 64k bytes. to manage higher addresses we must split the reading operations or ...
    
    if(address > STM32EE_maxEEPROMsize)
    {
        return(stm32ee_res_NOK);
    }
    
    if((address+(*size)) > STM32EE_maxEEPROMsize)
    {
        return(stm32ee_res_NOK);
    }
    
    return(stm32ee_res_OK);
    
}


   
static stm32ee_result_t s_stm32ee_writebuffer(uint8_t* pBuffer, uint16_t WriteAddr, uint16_t NumByteToWrite)
{
    uint16_t NumOfPage = 0, NumOfSingle = 0, count = 0;
    uint16_t Addr = 0;

    Addr = WriteAddr % s_stm32ee_generics.pagesize;
    count = s_stm32ee_generics.pagesize - Addr;
    NumOfPage =  NumByteToWrite / s_stm32ee_generics.pagesize;
    NumOfSingle = NumByteToWrite % s_stm32ee_generics.pagesize;
 
    /*!< If WriteAddr is s_stm32ee_generics.pagesize aligned  */
    if(Addr == 0) 
    {
        /*!< If NumByteToWrite < s_stm32ee_generics.pagesize */
        if(NumOfPage == 0) 
        {
            /* Store the number of data to be written */
            s_stm32ee_generics.numberofbyte2writeinpage = NumOfSingle;
            /* Start writing data */
            s_stm32ee_writepage(pBuffer, WriteAddr, (uint16_t*)(&s_stm32ee_generics.numberofbyte2writeinpage));
            /* Wait transfer through DMA to be complete */
            s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
            while (s_stm32ee_generics.numberofbyte2writeinpage > 0)
            {
                if((s_stm32ee_generics.timeout--) == 0) {return s_stm32ee_timeoutexpired();};
            }
            s_stm32ee_waiteepromstandbystate();
        }
        /*!< If NumByteToWrite > s_stm32ee_generics.pagesize */
        else  
        {
            while(NumOfPage--)
            {
                /* Store the number of data to be written */
                s_stm32ee_generics.numberofbyte2writeinpage = s_stm32ee_generics.pagesize;        
                s_stm32ee_writepage(pBuffer, WriteAddr, (uint16_t*)(&s_stm32ee_generics.numberofbyte2writeinpage)); 
                /* Wait transfer to be complete */
                s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
                while (s_stm32ee_generics.numberofbyte2writeinpage > 0)
                {
                    if((s_stm32ee_generics.timeout--) == 0) {return s_stm32ee_timeoutexpired();};
                }      
                s_stm32ee_waiteepromstandbystate();
                WriteAddr +=  s_stm32ee_generics.pagesize;
                pBuffer += s_stm32ee_generics.pagesize;
            }

            if(NumOfSingle!=0)
            {
                /* Store the number of data to be written */
                s_stm32ee_generics.numberofbyte2writeinpage = NumOfSingle;          
                s_stm32ee_writepage(pBuffer, WriteAddr, (uint16_t*)(&s_stm32ee_generics.numberofbyte2writeinpage));
                /* Wait transfer to be complete */
                s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
                while (s_stm32ee_generics.numberofbyte2writeinpage > 0)
                {
                    if((s_stm32ee_generics.timeout--) == 0) {return s_stm32ee_timeoutexpired();};
                }    
                s_stm32ee_waiteepromstandbystate();
            }
        }
    }
    /*!< If WriteAddr is not s_stm32ee_generics.pagesize aligned  */
    else 
    {
        /*!< If NumByteToWrite < s_stm32ee_generics.pagesize */
        if(NumOfPage== 0) 
        {
            /*!< If the number of data to be written is more than the remaining space 
            in the current page: */
            if (NumByteToWrite > count)
            {
                /* Store the number of data to be written */
                s_stm32ee_generics.numberofbyte2writeinpage = count;        
                /*!< Write the data contained in same page */
                s_stm32ee_writepage(pBuffer, WriteAddr, (uint16_t*)(&s_stm32ee_generics.numberofbyte2writeinpage));
                /* Wait transfer to be complete */
                s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
                while (s_stm32ee_generics.numberofbyte2writeinpage > 0)
                {
                    if((s_stm32ee_generics.timeout--) == 0) {return s_stm32ee_timeoutexpired();};
                }          
                s_stm32ee_waiteepromstandbystate();      
                
                /* Store the number of data to be written */
                s_stm32ee_generics.numberofbyte2writeinpage = (NumByteToWrite - count);          
                /*!< Write the remaining data in the following page */
                s_stm32ee_writepage((uint8_t*)(pBuffer + count), (WriteAddr + count), (uint16_t*)(&s_stm32ee_generics.numberofbyte2writeinpage));
                /* Wait transfer to be complete */
                s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
                while (s_stm32ee_generics.numberofbyte2writeinpage > 0)
                {
                    if((s_stm32ee_generics.timeout--) == 0) {return s_stm32ee_timeoutexpired();};
                }     
                s_stm32ee_waiteepromstandbystate();        
            }      
            else      
            {
                /* Store the number of data to be written */
                s_stm32ee_generics.numberofbyte2writeinpage = NumOfSingle;         
                s_stm32ee_writepage(pBuffer, WriteAddr, (uint16_t*)(&s_stm32ee_generics.numberofbyte2writeinpage));
                /* Wait transfer to be complete */
                s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
                while (s_stm32ee_generics.numberofbyte2writeinpage > 0)
                {
                    if((s_stm32ee_generics.timeout--) == 0) {return s_stm32ee_timeoutexpired();};
                }          
                s_stm32ee_waiteepromstandbystate();        
            }     
        }
        /*!< If NumByteToWrite > s_stm32ee_generics.pagesize */
        else
        {
            NumByteToWrite -= count;
            NumOfPage =  NumByteToWrite / s_stm32ee_generics.pagesize;
            NumOfSingle = NumByteToWrite % s_stm32ee_generics.pagesize;

            if(count != 0)
            {  
                /* Store the number of data to be written */
                s_stm32ee_generics.numberofbyte2writeinpage = count;         
                s_stm32ee_writepage(pBuffer, WriteAddr, (uint16_t*)(&s_stm32ee_generics.numberofbyte2writeinpage));
                /* Wait transfer to be complete */
                s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
                while (s_stm32ee_generics.numberofbyte2writeinpage > 0)
                {
                    if((s_stm32ee_generics.timeout--) == 0) {return s_stm32ee_timeoutexpired();};
                }     
                s_stm32ee_waiteepromstandbystate();
                WriteAddr += count;
                pBuffer += count;
            } 

            while(NumOfPage--)
            {
                /* Store the number of data to be written */
                s_stm32ee_generics.numberofbyte2writeinpage = s_stm32ee_generics.pagesize;          
                s_stm32ee_writepage(pBuffer, WriteAddr, (uint16_t*)(&s_stm32ee_generics.numberofbyte2writeinpage));
                /* Wait transfer to be complete */
                s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
                while (s_stm32ee_generics.numberofbyte2writeinpage > 0)
                {
                    if((s_stm32ee_generics.timeout--) == 0) {return s_stm32ee_timeoutexpired();};
                }        
                s_stm32ee_waiteepromstandbystate();
                WriteAddr +=  s_stm32ee_generics.pagesize;
                pBuffer += s_stm32ee_generics.pagesize;  
            }
            if(NumOfSingle != 0)
            {
                /* Store the number of data to be written */
                s_stm32ee_generics.numberofbyte2writeinpage = NumOfSingle;           
                s_stm32ee_writepage(pBuffer, WriteAddr, (uint16_t*)(&s_stm32ee_generics.numberofbyte2writeinpage)); 
                /* Wait transfer to be complete */
                s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
                while (s_stm32ee_generics.numberofbyte2writeinpage > 0)
                {
                    if((s_stm32ee_generics.timeout--) == 0) {return s_stm32ee_timeoutexpired();};
                }         
                s_stm32ee_waiteepromstandbystate();
            }
        }
    }

