robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/utils/stm32ee.c
    return(stm32ee_res_OK);
}



static stm32ee_result_t s_stm32ee_writepage(uint8_t* pBuffer, uint16_t WriteAddr, uint16_t* NumByteToWrite)
{ 
    /*  Set the pointer to the Number of data to be written. This pointer will be used 
        by the DMA Transfer Completer interrupt Handler in order to reset the 
        variable to 0. User should check on this variable in order to know if the 
        DMA transfer has been complete or not. */
    s_stm32ee_generics.prt2bytes2write = NumByteToWrite;  
  
    /*!< While the bus is busy */
    s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
    while(I2C_GetFlagStatus(s_stm32ee_generics.i2cx, I2C_FLAG_BUSY))
    {
        if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
    }

    /*!< Send START condition */
    I2C_GenerateSTART(s_stm32ee_generics.i2cx, ENABLE);

    /*!< Test on EV5 and clear it */
    s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
    while(!I2C_CheckEvent(s_stm32ee_generics.i2cx, I2C_EVENT_MASTER_MODE_SELECT))
    {
        if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
    }
  
    /*!< Send EEPROM address for write */
    s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
    I2C_Send7bitAddress(s_stm32ee_generics.i2cx, s_stm32ee_generics.hwaddress, I2C_Direction_Transmitter);

    /*!< Test on EV6 and clear it */
    s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
    while(!I2C_CheckEvent(s_stm32ee_generics.i2cx, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
    {
        if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
    }

//#ifdef sEE_M24C08
//  
//  /*!< Send the EEPROM's internal address to write to : only one byte Address */
//  I2C_SendData(s_stm32ee_generics.i2cx, WriteAddr);
//  
//#elif defined(sEE_M24C64_32)
  
  
    /*!< Send the EEPROM's internal address to write to : MSB of the address first */
    I2C_SendData(s_stm32ee_generics.i2cx, (uint8_t)((WriteAddr & 0xFF00) >> 8));

    /*!< Test on EV8 and clear it */
    s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;  
    while(!I2C_CheckEvent(s_stm32ee_generics.i2cx, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
    {
        if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
    }  

    /*!< Send the EEPROM's internal address to write to : LSB of the address */
    I2C_SendData(s_stm32ee_generics.i2cx, (uint8_t)(WriteAddr & 0x00FF));
  
//#endif /*!< sEE_M24C08 */  
  
    /*!< Test on EV8 and clear it */
    s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag; 
    while(!I2C_CheckEvent(s_stm32ee_generics.i2cx, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
    {
        if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
    } 

    if(0 == s_stm32ee_generics.cfg.dmacfg.dontuse)
    { 
        /* Configure the DMA Tx Channel with the buffer address and the buffer size */
        //s_stm32ee_dma_config((uint32_t)pBuffer, (uint32_t)(*NumByteToWrite), sEE_DIRECTION_TX);
        s_stm32ee_dma_config_tx((uint32_t)pBuffer, (uint32_t)(*NumByteToWrite));

        /* Enable the DMA Tx Stream */
        DMA_Cmd(stm32ee_hid_dma_stream_tx, ENABLE);
    }
    else
    {
       
        while(*NumByteToWrite)
        {       
            /*!< Send the byte to be written */
            I2C_SendData(s_stm32ee_generics.i2cx, *pBuffer); 
            
            pBuffer++;
            (*NumByteToWrite)--;
            
            /*!< Test on EV8 and clear it */
            s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag; 
            while(!I2C_CheckEvent(s_stm32ee_generics.i2cx, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
            {
                if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
            }  
        }        
 
        /*!< Send STOP condition */
        I2C_GenerateSTOP(s_stm32ee_generics.i2cx, ENABLE);
        
        /* Perform a read on SR1 and SR2 register to clear eventualaly pending flags */
        (void)(s_stm32ee_generics.i2cx)->SR1;
        (void)(s_stm32ee_generics.i2cx)->SR2;        
        // end        
    }
  
    /* If all operations OK, return OK (0) */
    return stm32ee_res_OK;
}


static stm32ee_result_t s_stm32ee_waiteepromstandbystate(void)      
{
    volatile uint16_t tmpSR1 = 0;
    volatile uint32_t sEETrials = 0;

    /*!< While the bus is busy */
    s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
    while(I2C_GetFlagStatus(s_stm32ee_generics.i2cx, I2C_FLAG_BUSY))
    {
        if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
    }

    /*  Keep looping till the slave acknowledge his address or maximum number 
        of trials is reached (this number is defined by stm32ee_hid_ackaddress_maxtrials define
        in stm324xg_eval_i2c_ee.h file) */
    while (1)
    {
        /*!< Send START condition */
        I2C_GenerateSTART(s_stm32ee_generics.i2cx, ENABLE);

        /*!< Test on EV5 and clear it */
        s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
        while(!I2C_CheckEvent(s_stm32ee_generics.i2cx, I2C_EVENT_MASTER_MODE_SELECT))
        {
            if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
        }    

        /*!< Send EEPROM address for write */
        I2C_Send7bitAddress(s_stm32ee_generics.i2cx, s_stm32ee_generics.hwaddress, I2C_Direction_Transmitter);

        /* Wait for ADDR flag to be set (Slave acknowledged his address) */
        s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
        do
        {     
            /* Get the current value of the SR1 register */
            tmpSR1 = (s_stm32ee_generics.i2cx)->SR1;

            /* Update the timeout value and exit if it reach 0 */
            if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
        }
        /* Keep looping till the Address is acknowledged or the AF flag is 
        set (address not acknowledged at time) */
        while((tmpSR1 & (I2C_SR1_ADDR | I2C_SR1_AF)) == 0);

        /* Check if the ADDR flag has been set */
        if (tmpSR1 & I2C_SR1_ADDR)
        {
            /* Clear ADDR Flag by reading SR1 then SR2 registers (SR1 have already 
            been read) */
            (void)(s_stm32ee_generics.i2cx)->SR2;

            /*!< STOP condition */    
            I2C_GenerateSTOP(s_stm32ee_generics.i2cx, ENABLE);

            /* Exit the function */
            return stm32ee_res_OK;
        }
        else
        {
            /*!< Clear AF flag */
            I2C_ClearFlag(s_stm32ee_generics.i2cx, I2C_FLAG_AF);                  
        }

        /* Check if the maximum allowed number of trials has bee reached */
        if (sEETrials++ == stm32ee_hid_ackaddress_maxtrials)
        {
            /* If the maximum number of trials has been reached, exit the function */
            return s_stm32ee_timeoutexpired();
        }
    }
}




static stm32ee_result_t s_stm32ee_timeoutexpired(void) 
{
    if(NULL != s_stm32ee_generics.cfg.devcfg.functionontimeout)
    {
        s_stm32ee_generics.cfg.devcfg.functionontimeout();
        return(stm32ee_res_NOK);
    }
    else
    {
        for(;;);
    }
    
    return(stm32ee_res_NOK);
}


//#endif//HAL_USE_EEPROM

// --------------------------------------------------------------------------------------------------------------------
// - end-of-file (leave a blank line after)
// --------------------------------------------------------------------------------------------------------------------



